app/Models/ModelBerita.php

    public function AllData()
    {
        return $this->db
        ->table('berita')
        ->get()
        ->getResultArray();
---
SELECT *
FROM `berita`